app/controllers/coworkers_controller.rb

  def index
    @coworkers = Coworker.all
---
SELECT `coworkers`.* FROM `coworkers`

  def show
    @coworker = Coworker.find(params[:id])
---
SELECT "coworkers".* FROM "coworkers" WHERE "coworkers"."id" = $1 LIMIT 1  [["id", "1"]]

  def edit
    @coworker = Coworker.find(params[:id])
---
SELECT "coworkers".* FROM "coworkers" WHERE "coworkers"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @coworker = Coworker.new(params[:coworker])

    respond_to do |format|
      if @coworker.save
---
INSERT INTO `coworkers` (`created_at`, `email`, `name`, `password_digest`, `updated_at`) VALUES ('2012-08-28 21:14:10', 'leyi.shi@gmail.com', '乐怡', '$2a$10$sOkjy6StClCsmOVum1qKT.WZXOKiSYQXCM1IHfmoht4hYuNazSkLe', '2012-08-28 21:14:10')

  def update
    @coworker = Coworker.find(params[:id])
---
SELECT `coworkers`.* FROM `coworkers` WHERE `coworkers`.`id` = 1 LIMIT 1