app/controllers/ministries_controller.rb

SELECT `ministries`.* FROM `ministries`
---
  def index
    @ministries = Ministry.all

SELECT "ministries".* FROM "ministries" WHERE "ministries"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @ministry = Ministry.find(params[:id])

SELECT "ministries".* FROM "ministries" WHERE "ministries"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def edit
    @ministry = Ministry.find(params[:id])

INSERT INTO "ministries" ("created_at", "description", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Wed, 29 Aug 2012 14:33:48 UTC +00:00], ["description", ""], ["name", "查经"], ["updated_at", Wed, 29 Aug 2012 14:33:48 UTC +00:00]]
---
  def create
    @ministry = Ministry.new(params[:ministry])

    respond_to do |format|
      if @ministry.save