app/controllers/sessions_controller.rb

SELECT "coworkers".* FROM "coworkers" WHERE "coworkers"."email" = 'jinze_li@yahoo.com' LIMIT 1
---
  def create
    coworker = Coworker.find_by_email(params[:session][:email].downcase)